## 数据的聚合与分组运算

In [1]:
import pandas as pd
import numpy as np

In [3]:
df1= pd.DataFrame({'animal': 'cat dog cat fish dog cat cat'.split(), 'size': list('SSMMMLL'),'weight': [8, 10, 11, 1, 20, 12, 12],'adult' : [False] * 5 + [True] * 2})

In [10]:
df=pd.DataFrame({'animal':'cat dog cat fish dog cat cat'.split(),'size':list('SSMMMLL'),'weight':[8,10,11,1,20,12,12],'adult':[False]*5+[True]*2})#split()按空格分成列表

In [12]:
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [13]:
df.groupby(df['animal'])['weight'].mean()#分组，求平均值，按animal分组

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [14]:
df.groupby(df['animal'])['weight'].mean()

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [15]:
df.groupby(df['animal'])['weight'].mean()

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [16]:
df.groupby(df['animal'])['weight'].mean()

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [17]:
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [19]:
df.groupby('animal')['weight'].mean()#可直接传入列名，不用df[]

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [20]:
df.groupby('animal').mean()#size列是str，无法求值，被扔掉了，其他按分组求平均值；True=1,False=0

        adult  weight
animal
cat       0.5   10.75
dog       0.0   15.00
fish      0.0    1.00

In [23]:
data=df.groupby(['animal','adult'])['weight'].mean()#生成层次化索引

In [24]:
data

animal  adult
cat     False     9.5
        True     12.0
dog     False    15.0
fish    False     1.0
Name: weight, dtype: float64

In [25]:
data.unstack()#把内层索引换成列索引

adult   False  True
animal
cat       9.5   12.0
dog      15.0    NaN
fish      1.0    NaN

In [28]:
data = df.groupby(np.array(['guonei','waiguo','guonei','guonei','waiguo','guonei','waiguo'])).mean()#列数正好相同，相当于作为索引了

In [29]:
data

           adult  weight
guonei  0.250000       8
waiguo  0.333333      14

In [30]:
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [36]:
df.groupby('size').size()#求个数

size
L    2
M    3
S    2
dtype: int64

In [34]:
df.groupby(df['animal'])[['weight']].mean()#在['weight]外的[]代表产生DateFrame

        weight
animal
cat      10.75
dog      15.00
fish      1.00

In [35]:
df.groupby('animal')[['weight']].mean()

        weight
animal
cat      10.75
dog      15.00
fish      1.00

In [37]:
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [44]:
df2=df.set_index('animal')#设置索引set_index()

In [45]:
df2

        adult size  weight
animal
cat     False    S       8
dog     False    S      10
cat     False    M      11
fish    False    M       1
dog     False    M      20
cat      True    L      12
cat      True    L      12

In [46]:
df2.groupby(len)[['weight']].mean()#(len)按索引长度

      weight
3  12.166667
4   1.000000

In [47]:
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [49]:
df.groupby('animal')[['weight']].apply(lambda x:x-x.mean())#减去在这一类中的均值，apply（lambda x: ）

   weight
0   -2.75
1   -5.00
2    0.25
3    0.00
4    5.00
5    1.25
6    1.25

** 注意上一例中的x.mean（）是分组后的平均值 **

In [51]:
df

   adult animal size  weight
0  False    cat    S       8
1  False    dog    S      10
2  False    cat    M      11
3  False   fish    M       1
4  False    dog    M      20
5   True    cat    L      12
6   True    cat    L      12

In [55]:
df.groupby('animal').apply(lambda x: x['size'][x['weight'].idxmax()])#idxmax,idxmax,idxmax,idxmax,idxmax,idxmax

animal
cat     L
dog     M
fish    M
dtype: object

In [56]:
df.groupby('animal').apply(lambda x: x['size'][x['weight'].idxmax()])
df.groupby('animal').apply(lambda x: x['size'][x['weight'].idxmax()])

animal
cat     L
dog     M
fish    M
dtype: object

In [57]:
gb=df.groupby('animal')

In [60]:
gb.get_group('cat')#get_group得到cat的分组，get_group

   adult animal size  weight
0  False    cat    S       8
2  False    cat    M      11
5   True    cat    L      12
6   True    cat    L      12